from telethon import events
from __main__ import client

@client.on(events.NewMessage(pattern=r'\.اوامري', outgoing=True))
async def help_menu(event):
    help_text = """
🛡️ **سورس المتمرد التقني - الإصدار الأول** 🛡️
─── • ⚡️ • ───

🚀 **[ الفحص والسرعة ]**
• `.بينج` : قياس سرعة استجابة السورس.
• `.وقت` : عرض الوقت والتاريخ (اليمن).
• `.فحص` : للتأكد من اتصال السورس.

📣 **[ أوامر الإذاعة ]**
• `.اذاعة للخاص` : نشر رسالة لكل الخاص.
• `.اذاعة للجروبات` : نشر رسالة لكل الجروبات.

🛠️ **[ الأدوات والتحكم ]**
• `.ايدي` : استخراج هويتك أو هوية غيرك.
• `.اسم وقتي` : تحديث اسمك مع الساعة تلقائياً.
• `.سحب` : سحب ميديا من القنوات المقيدة.
• `.تحويل` : تحويل الملصق إلى صورة.

🛡️ **[ الإدارة والحماية ]**
• `.حذف` : حذف الرسالة (بالرد).
• `.طرد` : طرد عضو من الجروب.
• `.تثبيت` : تثبيت رسالة مهمة.

─── • ⚡️ • ───
👤 **المطور:** @Vi_ti0
🌐 **القناة:** @bedmoddinnow
"""
    await event.edit(help_text)

