from telethon import events

@events.register(events.NewMessage(pattern=r"\.(اوامري|الاوامر|اوامر)$", outgoing=True))
async def help_menu(event):
    help_text = """
🛡️ **سـورس الـمـتـمـرد الـتـقـنـي V1** 🛡️
─── • ⚡️ • ───
🚀 **[ الـفـحـص والـسرعـة ]**
• `.بينج` : قياس سرعة الاستجابة.
• `.وقت` : الوقت والتاريخ في اليمن.

💀 **[ الأوامـر والـحمـايـة ]**
• `.كشف` : معلومات الحساب.
• `.حماية تفعيل/تعطيل` : درع الخاص.

🎮 **[ الـتـسـلـيـة ]**
• `.نكته` | `.لو خيروك`
─── • ⚡️ • ───
👤 **المـطـور:** @Vi_ti0
"""
    await event.edit(help_text)
