# لازم السطرين ذولا يكونوا في البداية بالضبط
from main import CMD_HELP

CMD_HELP["أوامر المتمرد"] = [
    "احصائياتي", "الادوات", "الرابط", "الوقت", "انتظر", "انهاء",
    "اوامر الاحصائيات", "اوامر الادوات", "اوامر الاعدادات", "اوامر التقنية",
    "اوامر الخصوصية", "اوامر الذكاء", "اوامر السرعة", "اوامر السيبراني",
    "اوامر الكروب", "اوامر سوا", "ايدي", "تأمين", "تحديث", "تحذير",
    "تدمير", "تسريع", "تشفير آلي", "تشكيلة", "تعطيل الحماية", "تفعيل الحماية",
    "تلفيش", "حالة السورس", "حظر", "حظي", "رابط", "رادار", "رفض",
    "سلام", "سماح", "طرد", "عن المتمرد", "غادر", "فحص", "قرصنة",
    "قصف", "قفل الحساب", "كشف الجروب", "مسح", "مصفوفة", "معلوماتي",
    "نبض", "نسبة", "هويتي", "هيبة"
]
